monte-monte/ch32v003fun/examples_v20x/spi_dma_chain/spi_dma_chain.c
	// I've found that GPIO modes other than 2MHz, at least in case of slave SPI MISO doesn't really work that great (if at all).
	// 2MHz is more stable and I didn't find any downsides.
	if (spi->addr == SPI1) {
		funPinMode(SPI1_CS1, mode?GPIO_CFGLR_OUT_2Mhz_PP:GPIO_CNF_IN_PUPD);
		funPinMode(PA5, mode?GPIO_CFGLR_OUT_2Mhz_AF_PP:GPIO_CNF_IN_FLOATING);
		funPinMode(PA6, mode?GPIO_CNF_IN_FLOATING:GPIO_CFGLR_OUT_2Mhz_AF_PP);
		funPinMode(PA7, mode?GPIO_CFGLR_OUT_2Mhz_AF_PP:GPIO_CNF_IN_FLOATING);
		RCC->APB2PRSTR = RCC_SPI1RST;
		RCC->APB2PRSTR = 0;
		RCC->APB2PCENR |= RCC_APB2Periph_SPI1;
	} else {
		funPinMode(SPI2_CS1, mode?GPIO_CFGLR_OUT_2Mhz_PP:GPIO_CNF_IN_PUPD);
		funPinMode(PB13, mode?GPIO_CFGLR_OUT_2Mhz_AF_PP:GPIO_CNF_IN_FLOATING);
		funPinMode(PB14, mode?GPIO_CNF_IN_FLOATING:GPIO_CFGLR_OUT_2Mhz_AF_PP);
		funPinMode(PB15, mode?GPIO_CFGLR_OUT_2Mhz_AF_PP:GPIO_CNF_IN_FLOATING);
		RCC->APB1PRSTR = RCC_SPI2RST;
		RCC->APB1PRSTR = 0;
		RCC->APB1PCENR |= RCC_APB1Periph_SPI2;
	}

	// Configure SPI 
	spi->addr->CTLR1 = (mode?SPI_NSS_Soft:0) | SPI_CPHA_1Edge | SPI_CPOL_Low | (sixteen_bits?SPI_DataSize_16b:0) | SPI_BaudRatePrescaler_16 | (mode?SPI_Mode_Master:0);
	// spi->CRCR = 7;

	// DMA only works in Master mode for some reason. Need to use interrupts in Slave mode.
	if (mode) {
		spi->master = 1;
		spi->addr->CTLR2 = SPI_CTLR2_RXDMAEN | SPI_CTLR2_TXDMAEN;
		
		if (spi->addr == SPI1) {
			setupDMA(2, spi->addr, DMA_In, sixteen_bits, spi->buffer->in);
			setupDMA(3, spi->addr, DMA_Out, sixteen_bits, spi->buffer->out);
		} else {
			setupDMA(4, spi->addr, DMA_In, sixteen_bits, spi->buffer->in);
			setupDMA(5, spi->addr, DMA_Out, sixteen_bits, spi->buffer->out);
		}
	}

	spi->addr->CTLR1 |= CTLR1_SPE_Set; // Enable SPI

}

void spi_send(spi_t * spi, uint8_t n_packets) {
#if DEBUG_SPI
	printf("%s OUT ", (spi->master?"Master":"Slave"));
	printf("[%ld] %02x %02x %02x %02x %02x %02x %02x %02x\n", spi->buffer->pos_out, spi->buffer->out[spi->buffer->pos_out], spi->buffer->out[spi->buffer->pos_out+1], spi->buffer->out[spi->buffer->pos_out+2], spi->buffer->out[spi->buffer->pos_out+3], spi->buffer->out[spi->buffer->pos_out+4], spi->buffer->out[spi->buffer->pos_out+5], spi->buffer->out[spi->buffer->pos_out+6], spi->buffer->out[spi->buffer->pos_out+7]);
#endif
	// Update position in buffer for next data
	// Loop the buffer if needed
	if ((spi->buffer->pos_out += PACKET_SIZE * n_packets) >= BUFFER_SIZE) spi->buffer->pos_out -= BUFFER_SIZE;

	// Master needs to initiate a transmission if it's not in progress already
	// Slave will transmit in interrupt when master will initiate, so nothing to do here
	if (spi->master && spi->transmission == SPI_IDLE) {
		spi->dma_out->CFGR &= ~DMA_CFGR1_EN; // Disable DMA to be able to make changes
		spi->dma_out->MADDR = (uint32_t)&spi->buffer->out[spi->buffer->sending_pos]; // Update buffer postion address

		if (spi->buffer->sending_pos >= spi->buffer->pos_out) { // This means we are looping over buffer
			spi->dma_out->CNTR = BUFFER_SIZE - spi->buffer->sending_pos;
			spi->buffer->sending_pos = 0; // We'll send the rest in another transmission
		} else {
			spi->dma_out->CNTR = spi->buffer->pos_out - spi->buffer->sending_pos;
			spi->buffer->sending_pos = spi->buffer->pos_out;
		}

		funDigitalWrite(spi->cs_pin, 0); // CS low to start transmission
		spi->transmission = SPI_IN_PROGRESS;
		Delay_Ms(2); // Let slave to react
		spi->dma_out->CFGR |= DMA_CFGR1_EN;
		polling_timer = SysTick->CNT + Ticks_from_Ms(SPI_POLLING_INTERVAL);
	}
}

void spi_send_message(spi_t * spi, uint8_t receiver_id, uint16_t message_id, uint8_t* buf, uint8_t len) {
#if !SPI_FORCED_SENDING
	if (spi->nodes.map[0] == 0) return;
#endif
	if (!len) return;

	spi->buffer->out[spi->buffer->pos_out] = (uint8_t)NODE_ID;
	spi->buffer->out[spi->buffer->pos_out+1] = receiver_id;
	if (!message_id) {
		if (spi->out_message_number++ > 16383) spi->out_message_number = 1;
		spi->buffer->out[spi->buffer->pos_out+2] = (uint8_t)(spi->out_message_number>>6);
		spi->buffer->out[spi->buffer->pos_out+3] = (uint8_t)((spi->out_message_number<<2) | 3);
	} else {
		spi->buffer->out[spi->buffer->pos_out+2] = (uint8_t)(message_id>>6);
		spi->buffer->out[spi->buffer->pos_out+3] = (uint8_t)(message_id);
	}

	// TODO: make a loop to send long messages in multiple packets
	if (len > PACKET_SIZE - 4) len = PACKET_SIZE - 4;
	if (len < PACKET_SIZE - 4) memset(&spi->buffer->out[spi->buffer->pos_out+4+len], 0, PACKET_SIZE - 4 - len);
	memcpy(&spi->buffer->out[spi->buffer->pos_out+4], buf, len);

	spi_send(spi, 1);
}

void spi_send_control(spi_t * spi, uint8_t receiver_id, uint16_t message_id, uint8_t ack) {
#if !SPI_FORCED_SENDING
	if (spi->nodes.map[0] == 0) return;
#endif
	spi->buffer->out[spi->buffer->pos_out] = (uint8_t)NODE_ID;
	spi->buffer->out[spi->buffer->pos_out+1] = receiver_id;
	spi->buffer->out[spi->buffer->pos_out+2] = (uint8_t)(message_id>>6);
	spi->buffer->out[spi->buffer->pos_out+3] = (uint8_t)(message_id);

	// second bit 1 - ACK, 0 - NAK
	if (ack) spi->buffer->out[spi->buffer->pos_out+3] |= 2;
	else spi->buffer->out[spi->buffer->pos_out+3] &= ~(2);
	for (int i = 4; i < PACKET_SIZE; i++) {
		spi->buffer->out[spi->buffer->pos_out+i] = 0;
	}

	spi_send(spi, 1);
}

void spi_poll() {
#if SPI_ENABLE_POLLING
#if DEBUG_SPI
	printf("Polling...\n");
#endif
	// Slave will ignore empty message, but will send any data it has to send
	spi_master->buffer->out[spi_master->buffer->pos_out] = NODE_ID;
	for (int i = 1; i < PACKET_SIZE; i++) {
		spi_master->buffer->out[spi_master->buffer->pos_out + i] = 0;
	}
	spi_send(spi_master, 1);
#endif
}

void enumerate(spi_t * spi, command_t cmd) {
#if DEBUG_SPI
	printf("%s ENUM OUT %d\n", spi->master?"Master":"Slave", cmd);
#endif
	if (cmd == CMD_ENUM_UPDATE && spi->another->nodes.n_nodes && spi->nodes.n_nodes) {
		spi_send_message(spi, spi->nodes.map[0], 0, (uint8_t*)(&(uint8_t[]){CMD_ENUM_UPDATE, spi->another->nodes.map[0], spi->another->nodes.map[1], spi->another->nodes.map[2], spi->another->nodes.map[3], spi->another->nodes.map[4]}), 6);
		if (spi->another->nodes.n_nodes > 5) {
			spi_send_message(spi, spi->nodes.map[0], (spi->out_message_number<<2)|1, &spi->another->nodes.map[5], spi->another->nodes.n_nodes - 5);
			spi_send_message(spi, spi->nodes.map[0], (spi->out_message_number<<2)|1, (uint8_t*)(&(uint8_t[]){0xff}), 1);
		}
	} else if (cmd == CMD_ENUM_REQUEST) {
		spi_send_message(spi, spi->nodes.map[0], 0, (uint8_t[]){CMD_ENUM_REQUEST}, 1);
		spi->out_pending_command = CMD_ENUM_REQUEST;
	} else if (cmd == CMD_ENUM_REPLY) {
		if (spi->another->nodes.n_nodes) { // Not necessary chack but for clearance
			spi_send_message(spi, spi->nodes.map[0], (spi->out_message_number<<2)|2, &spi->another->nodes.map[0], spi->another->nodes.n_nodes);
		}
		spi_send_message(spi, spi->nodes.map[0], (spi->out_message_number<<2)|2, (uint8_t*)(&(uint8_t[]){0xff}), 1);
	}
}

void process_message(spi_t * spi) {
	if ((uint8_t)spi->enumeration_state > (uint8_t)ENUM_DONE ) {
		// Send to another part of the chain updated nodes map
		enumerate(spi->another, CMD_ENUM_UPDATE);
		// If we found a new neighbour we want to send our known map to it too
		if (spi->enumeration_state == ENUM_INIT) enumerate(spi, CMD_ENUM_UPDATE);
		spi->enumeration_state = ENUM_DONE;
		printf("SPI %s nodes map updated: [%02X", (spi->master?"master":"slave"), spi->nodes.map[0]);
		for (int i = 1; i < spi->nodes.n_nodes; i++) {
			printf(", %02X", spi->nodes.map[i]);
		}
		printf("]\n");
	}

	if (spi->incomming_message_pos < 0 || spi->transmission_size == 0) {
		// spi->transmission_packets_n = 0;
		// spi->incomming_message_pos = -1;
		return;
	}

	uint8_t local_message[PACKET_SIZE];
	uint32_t old_number = spi->out_message_number;
	do {
		memcpy(local_message, &spi->buffer->in[spi->incomming_message_pos], PACKET_SIZE);
#if DEBUG_SPI
		printf("%s IN ", spi->master?"Master":"Slave");
		for (int n = 0; n < PACKET_SIZE; n++) {
			printf("%02x ", local_message[n]);
		}
		printf("\n");
#endif
		// Copying a message to process, so it won't be overwritten by the IRQ in the process
		memcpy(local_message, &spi->buffer->in[spi->incomming_message_pos], PACKET_SIZE);
		if (spi->incomming_message_pos += PACKET_SIZE >= BUFFER_SIZE) spi->incomming_message_pos = 0;
		// Check the message number that is located in 3rd and 4th bits
		uint16_t message_id = (local_message[2]<<8) | local_message[3];
		// Valid message always has to have a number
		// It should be filtered in process_incomming, but still checking here
		if (!message_id) continue;
		// LSB of the message number is to mark new message vs a reply
		uint16_t message_number = message_id >> 2;

		bool message_is_reply = !(message_id & 1);
		bool message_is_new = message_id & 1;
		bool ack = message_id & 2;
		bool message_is_sequel = (message_is_new && !ack);

		// Resend a command/message if NAK received while we waited a proper answer
		if (message_is_reply && !ack && spi->out_pending_command != CMD_IDLE && message_number == spi->out_message_number) {
			spi_send_message(spi, spi->previous_out_message[0], 0, spi->previous_out_message, PACKET_SIZE);
		// If this is a new message and we have no ongoing commands to finish
		} else if (message_is_new && spi->in_pending_command == CMD_IDLE) {
			
			switch (local_message[4]) {
				case CMD_ENUM_REQUEST:
					printf("CMD_ENUM_REQUEST\n");
					// Send enumberate command downstream
					enumerate(spi, CMD_ENUM_REPLY);
					break;
				case CMD_ENUM_UPDATE:
					printf("CMD_ENUM_UPDATE\n");
					spi->in_pending_command = CMD_ENUM_UPDATE;
					spi->nodes.n_nodes = 1; // Rewrite any old nodes in map
					for (int i = 5; i < PACKET_SIZE; i++) {
						if (local_message[i] == 0xff || local_message[i] == 0) {
							spi->in_pending_command = CMD_IDLE;
							// Send nodes map update if there is actually anything
							if (spi->nodes.n_nodes > 1) {
								enumerate(spi->another, CMD_ENUM_UPDATE);
								printf("SPI %s nodes map updated: [%02X", (spi->master?"master":"slave"), spi->nodes.map[0]);
								for (int i = 1; i < spi->nodes.n_nodes; i++) {
									printf(", %02X", spi->nodes.map[i]);
								}
								printf("]\n");
							}
							break;
						}
						spi->nodes.map[spi->nodes.n_nodes++] = local_message[i];
					}
					break;
				case CMD_LED_TOGGLE:
					printf("CMD_LED_TOGGLE\n");
					// Turn LED on/off
					// Ack
					funDigitalWrite(LED, !funDigitalRead(LED));
					spi_send_control(spi, local_message[1], message_number<<2, 1);
					break;
				case CMD_LED_OFF:
					printf("CMD_LED_OFF\n");
					funDigitalWrite(LED, !LED_ON);
					spi_send_control(spi, local_message[1], message_number<<2, 1);
					break;
				case CMD_LED_ON:
					printf("CMD_LED_ON\n");
					funDigitalWrite(LED, LED_ON);
					spi_send_control(spi, local_message[1], message_number<<2, 1);
					break;
				case CMD_READ_SENSOR:
					printf("CMD_READ_SENSOR\n");
					// read_sensor_local();
					spi->in_pending_command = local_message[4];
					// Or send cashed data if we do it frequently
					break;
				default:
					// printf("Incomming message: ");
					// for (int n = 0; n < PACKET_SIZE; n++) {
					//   printf("%02x ", local_message[n]);
					// }
					// printf("\n");
					break;
			}
		// If this is a new message, but we are still finishing replying to previous
		} else if (spi->in_pending_command != CMD_IDLE) {
			if (spi->in_message_number != message_number || !message_is_sequel) {
				printf("Unanswer message is pending: %d. Incomming message skipped.\n", spi->in_pending_command);
				// Maybe NAK here so the sender can repeat request later
				spi_send_control(spi, local_message[1], message_number, 0);
				continue; // Don't synchronize message number, skip to next message 
			}
			switch (spi->in_pending_command) {
				case CMD_ENUM_UPDATE:
					printf("CMD_ENUM_UPDATE SEQ\n");
					for (int i = 4; i < PACKET_SIZE; i++) {
						if (local_message[i] == 0xff || local_message[i] == 0) {
							spi->out_pending_command = CMD_IDLE;
							if (spi->nodes.n_nodes > 1) spi->enumeration_state = ENUM_CHANGED;
							break;
						}
						spi->nodes.map[spi->nodes.n_nodes++] = local_message[i];
					}
					break;
			}
		// If this is a reply and we are waiting for one
		} else if (!message_is_new && spi->out_pending_command != CMD_IDLE) {
			// And if this is a reply to a correct message
			if ((message_number >> 2) == old_number) {
				switch (spi->out_pending_command) {
					case CMD_ENUM_REQUEST:
					case CMD_ENUM_UPDATE:
						for (int i = 4; i < PACKET_SIZE; i++) {
							if (local_message[i] == 0xff || local_message[i] == 0) {
								spi->out_pending_command = CMD_IDLE;
								if (spi->nodes.n_nodes > 1)  spi->enumeration_state = ENUM_CHANGED;
								break;
							}
							spi->nodes.map[spi->nodes.n_nodes++] = local_message[i];
						}
						break;
					case CMD_LED_TOGGLE:
						spi->out_pending_command = CMD_IDLE;
						break;
					case CMD_READ_SENSOR:
						// Process incomming sensor data, just printing for now
						printf("Sensor data from [0x%02x]:%02x-%02x-%02x-%02x-%02x-%02x\n", local_message[1], local_message[4], local_message[5], local_message[6], local_message[7], local_message[8], local_message[9]);
						spi->out_pending_command = CMD_IDLE;
						break;
				}
			} else {
				// This shouldn't happen? A reply with a different number, where would it come from?
				printf("Unexpected message number: %d", message_number);
				continue;
			}
		// If this is a reply but we didn't request anythig - act confused but do nothing
		} else if (!message_is_new) {
			printf("Message number %04x, %d, type: %s Incomming message:\n", message_id, message_number, (message_is_new)?"new":"reply");
			for (uint8_t i = 0; i < PACKET_SIZE; i++) {
				printf("%02x ", local_message[i]);
			}
			printf("\n");
			// Probably still synchronize message number
		}
		// Syncronize message number?
		// Can potentially cause problem if incomming message with a different number from not neighboring node
		if (spi->out_message_number == old_number) {
			spi->out_message_number = message_number;
		}
	} while ((spi->transmission_size -= PACKET_SIZE) > 0);
	spi->transmission_size = 0;
	spi->incomming_message_pos = -1;
}

void read_sensor_local() {
	SPI_TypeDef * master = spi_master->addr;

	while ((master->STATR & SPI_I2S_FLAG_BSY)) {
		funDigitalWrite(spi_master->cs_pin, 1);
		spi_master->transmission = SPI_IDLE;
	}

