monte-monte/ch32v003fun/examples_v20x/spi_dma_chain/spi_dma_chain.c
	uint16_t save_ctlr2 = master->CTLR2;
	master->CTLR2 = 0; // Disable SPI DMA, and interrupts if enabled

	// do sensor stuff

	// Wait until done
	while ((master->STATR & SPI_I2S_FLAG_BSY)) {
		funDigitalWrite(spi_master->cs_pin, 1);
		spi_master->transmission = SPI_IDLE;
	}

	master->CTLR2 = save_ctlr2; // Restore SPI DMA and interrupt settings
}

int main()
{
	SystemInit();

	funGpioInitAll();

	funPinMode(LED, GPIO_CFGLR_OUT_2Mhz_PP);
	funPinMode(BUTTON, GPIO_CFGLR_IN_PUPD);
	funDigitalWrite(LED, LED_ON);
	funDigitalWrite(BUTTON, !BUTTON_POLARITY);

	printf("SPI setup\n");
	memset(spi_master->buffer->in, 0, BUFFER_SIZE);
	memset(spi_master->buffer->out, 0, BUFFER_SIZE);

	memset(spi_slave->buffer->in, 0, BUFFER_SIZE);
	memset(spi_slave->buffer->out, 0, BUFFER_SIZE);

	setup_SPI(spi_master, SPI_Master, 0);
	funDigitalWrite(spi_master->cs_pin, 1);
	spi_master->incomming_message_pos = -1;

	setup_SPI(spi_slave, SPI_Slave, 0);
	funDigitalWrite(spi_slave->cs_pin, 0);

	setupEXTI(spi_slave->cs_pin, 0);

#if CH32V10x == 1
	NVIC->CFGR = NVIC_KEY1|1;
#endif

	funDigitalWrite(LED, !LED_ON);

#if NODE_ID == 0xab
	uint8_t message_slave[PACKET_SIZE-4] = {0xff, 0xb7, 0xb5, 0xb3, 0xb2, 0xb1};
#else
	uint8_t message_slave[PACKET_SIZE-4] = {0xff, 0xc7, 0xc5, 0xc3, 0xc2, 0xc1};
#endif
	uint8_t message[PACKET_SIZE-4] = {0xff, 0xA1, 0xA2, 0xA3, 0xA5, 0xA7};

	while(1)
	{
		if ((int64_t)(SysTick->CNT - button_debounce_timer) > 0 && READ_BUTTON != last_button_state) {
			last_button_state = READ_BUTTON;
			button_debounce_timer = SysTick->CNT + Ticks_from_Ms(50);
			funDigitalWrite(LED, last_button_state);
			if (last_button_state == BUTTON_POLARITY) {
				if (spi_master->nodes.n_nodes && (int64_t)(SysTick->CNT - button_timer) > 0) {
					printf("LED toggle to [%02x]\n", spi_master->nodes.map[spi_master->nodes.n_nodes-1]);
					spi_send_message(spi_master, spi_master->nodes.map[spi_master->nodes.n_nodes-1], 0, (uint8_t[]){CMD_LED_TOGGLE}, 1);
					button_debounce_timer = SysTick->CNT + Ticks_from_Ms(BUTTON_SEND_DELAY);
				}
			}
		}

		if ((int64_t)(SysTick->CNT - timer) > 0) {
			spi_send_message(spi_master, 0, 0, message, PACKET_SIZE - 4);
			spi_send_message(spi_slave, 0, 0, message_slave, PACKET_SIZE - 4);
			timer = SysTick->CNT + Ticks_from_Ms(1000);
		}
		
		if ((int64_t)(SysTick->CNT - polling_timer) > 0 && spi_master->transmission == SPI_IDLE) {
			
			spi_poll();
			polling_timer = SysTick->CNT + Ticks_from_Ms(SPI_POLLING_INTERVAL);
		}

		if (!(spi_master->addr->STATR & SPI_I2S_FLAG_BSY) && spi_master->transmission != SPI_IDLE) {
			funDigitalWrite(spi_master->cs_pin, 1);
			// Maybe add a small delay here
			Delay_Ms(2);
			spi_master->transmission = SPI_IDLE;

			process_incoming(spi_master);
			
			if (spi_master->buffer->sending_pos != spi_master->buffer->pos_out) {
#if DEBUG_SPI        
				printf("There is something to send %ld - %ld\n", spi_master->buffer->sending_pos, spi_master->buffer->pos_out);
#endif
				spi_send(spi_master, 0);
			// In case we received any messages during last transmission, poll to see if there is anything in qeue 
			} else if (spi_master->incomming_message_pos >= 0) {
				spi_poll();
			}
		}
		process_message(spi_master);
		if (needs_process) process_incoming(spi_slave);
		process_message(spi_slave);
	}
}
